# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'drud/ddev'

# Binaries
brew 'awscli'
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ddev'
brew 'dockutil' # Used to manage dock items later in the install
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'docker'
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'maven'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask 'abstract'
cask 'brave-browser'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'java'
cask 'muse'
cask 'mysqlworkbench'
cask 'openemu'
cask 'postman'
cask 'sequel-pro'
cask 'sketch'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmit'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Evernote', id: 406056744
mas 'Jira', id: 1475897096
mas 'Harvest', id: 506189836
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Transmit', id: 1436522307